In [30]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import re
import seaborn

%matplotlib inline

On-Base Percentage (OBP) = Hits + Walks(BB) + Hit By Pitch(HBP) / At Bats(AB) + Walks + HBP + Sacrifice Flies

Note = Sacrifice Flies stats don't start until 1954.

Before that, SH = SF + Bunts

In [31]:
column_id = [0, 13, 14]
bio = pd.read_csv('data/Master.csv', usecols=column_id)
len(bio)

18846

In [32]:
bio = bio.rename(columns={'nameFirst': 'FirstName', 'nameLast': 'LastName'})

In [33]:
bio.head()

    playerID FirstName LastName
0  aardsda01     David  Aardsma
1  aaronha01      Hank    Aaron
2  aaronto01    Tommie    Aaron
3   aasedo01       Don     Aase
4   abadan01      Andy     Abad

In [34]:
column_id = [0, 1, 3, 4]
salary = pd.read_csv('data/Salaries.csv', usecols=column_id)
len(salary)

25575

In [35]:
column_id = [0, 1, 3, 5]
fielding = pd.read_csv('data/Fielding.csv', usecols=column_id)
len(fielding)

170526

In [36]:
column_id = [0, 1, 3, 5, 6, 8, 15, 18, 20]
batting = pd.read_csv('data/Batting.csv', usecols=column_id)
len(batting)

101332

In [37]:
data = pd.merge(batting, bio)
data = pd.merge(data, fielding)
data = pd.merge(data, salary)

In [38]:
len(data)

46885

In [39]:
data.head()

,playerID,yearID,teamID,G,AB,H,BB,HBP,SF,FirstName,LastName,POS,salary
0,johnto01,1985,OAK,11,NaN,NaN,NaN,NaN,NaN,Tommy,John,P,600000
1,johnto01,1986,NYA,13,NaN,NaN,NaN,NaN,NaN,Tommy,John,P,60000
2,johnto01,1987,NYA,33,NaN,NaN,NaN,NaN,NaN,Tommy,John,P,350000
3,johnto01,1988,NYA,35,NaN,NaN,NaN,NaN,NaN,Tommy,John,P,375000
4,rosepe01,1985,CIN,119,405.0,107.0,86.0,4.0,4.0,Pete,Rose,1B,358858

In [40]:
data_dropna = data.copy()

In [41]:
data_dropna = data_dropna.dropna()

In [42]:
len(data_dropna)

45008

In [43]:
data_dropna = data_dropna.drop_duplicates()

In [44]:
len(data_dropna)

44969

In [45]:
data_dropna['OBP'] = (data_dropna['H']+data_dropna['BB']+data_dropna['HBP'])/(data_dropna['AB']+data_dropna['BB']+data_dropna['HBP']+data_dropna['SF'])

In [46]:
data_dropna.head()

,playerID,yearID,teamID,G,AB,H,BB,HBP,SF,FirstName,LastName,POS,salary,OBP
4,rosepe01,1985,CIN,119,405.0,107.0,86.0,4.0,4.0,Pete,Rose,1B,358858,0.394790
5,rosepe01,1986,CIN,72,237.0,52.0,30.0,4.0,1.0,Pete,Rose,1B,1000000,0.316176
6,staubru01,1985,NYN,54,45.0,12.0,10.0,0.0,0.0,Rusty,Staub,OF,300000,0.400000
7,staubru01,1985,NYN,54,45.0,12.0,10.0,0.0,0.0,Rusty,Staub,RF,300000,0.400000
10,perezto01,1985,CIN,72,183.0,60.0,22.0,0.0,2.0,Tony,Perez,1B,225000,0.396135

In [47]:
data_dropna['Ratio'] = data_dropna['OBP']/data_dropna['salary']

In [48]:
moneyball = data_dropna[data_dropna['AB'] > 15]

In [49]:
moneyball.sort_values('Ratio', ascending=False).head()

,playerID,yearID,teamID,G,AB,H,BB,HBP,SF,FirstName,LastName,POS,salary,OBP,Ratio
6096,jamesdi01,1993,NYA,115,343.0,114.0,31.0,2.0,1.0,Dion,James,OF,0,0.38992,inf
6094,jamesdi01,1993,NYA,115,343.0,114.0,31.0,2.0,1.0,Dion,James,DH,0,0.38992,inf
6097,jamesdi01,1993,NYA,115,343.0,114.0,31.0,2.0,1.0,Dion,James,RF,0,0.38992,inf
6095,jamesdi01,1993,NYA,115,343.0,114.0,31.0,2.0,1.0,Dion,James,LF,0,0.38992,inf
6092,jamesdi01,1993,NYA,115,343.0,114.0,31.0,2.0,1.0,Dion,James,1B,0,0.38992,inf

In [50]:
moneyball.head()

,playerID,yearID,teamID,G,AB,H,BB,HBP,SF,FirstName,LastName,POS,salary,OBP,Ratio
4,rosepe01,1985,CIN,119,405.0,107.0,86.0,4.0,4.0,Pete,Rose,1B,358858,0.394790,1.100128e-06
5,rosepe01,1986,CIN,72,237.0,52.0,30.0,4.0,1.0,Pete,Rose,1B,1000000,0.316176,3.161765e-07
6,staubru01,1985,NYN,54,45.0,12.0,10.0,0.0,0.0,Rusty,Staub,OF,300000,0.400000,1.333333e-06
7,staubru01,1985,NYN,54,45.0,12.0,10.0,0.0,0.0,Rusty,Staub,RF,300000,0.400000,1.333333e-06
10,perezto01,1985,CIN,72,183.0,60.0,22.0,0.0,2.0,Tony,Perez,1B,225000,0.396135,1.760601e-06

In [51]:
moneyball.describe()

,yearID,G,AB,H,BB,HBP,SF,salary,OBP,Ratio
count,37131.000000,37131.000000,37131.000000,37131.000000,37131.000000,37131.000000,37131.000000,3.713100e+04,37131.000000,3.713100e+04
mean,1999.589777,92.357922,282.365517,74.801163,27.723870,2.484232,2.401928,1.817366e+06,0.310811,inf
std,8.664727,43.686782,182.457611,53.821261,23.760546,3.170917,2.411290,3.134848e+06,0.062433,NaN
min,1985.000000,4.000000,16.000000,0.000000,0.000000,0.000000,0.000000,0.000000e+00,0.000000,0.000000e+00
25%,1993.000000,55.000000,121.000000,28.000000,9.000000,0.000000,1.000000,2.550000e+05,0.285256,1.643664e-07
50%,1999.000000,95.000000,255.000000,65.000000,22.000000,1.000000,2.000000,5.110000e+05,0.319853,5.562130e-07
75%,2007.000000,131.000000,438.000000,117.000000,40.000000,4.000000,4.000000,1.900000e+06,0.350000,1.156305e-06
max,2015.000000,163.000000,716.000000,262.000000,232.000000,35.000000,17.000000,3.300000e+07,0.609400,inf

In [52]:
moneyball[moneyball['playerID'] == 'carltst01']

,playerID,yearID,teamID,G,AB,H,BB,HBP,SF,FirstName,LastName,POS,salary,OBP,Ratio
12,carltst01,1985,PHI,16,28.0,5.0,1.0,0.0,1.0,Steve,Carlton,P,1075000,0.200000,1.860465e-07
13,carltst01,1986,PHI,16,34.0,7.0,1.0,0.0,0.0,Steve,Carlton,P,1000000,0.228571,2.285714e-07

In [53]:
salary[salary['playerID'] == 'carltst01']

      yearID teamID   playerID   salary
389     1985    PHI  carltst01  1075000
673     1986    CHA  carltst01    60000
1072    1986    PHI  carltst01  1000000
2229    1988    MIN  carltst01   115000

In [54]:
column_id = [0, 1, 3, 4]
new_sal = pd.read_csv('data/Salaries.csv', usecols=column_id)

In [55]:
new_sal[new_sal['playerID'] == 'carltst01']

      yearID teamID   playerID   salary
389     1985    PHI  carltst01  1075000
673     1986    CHA  carltst01    60000
1072    1986    PHI  carltst01  1000000
2229    1988    MIN  carltst01   115000

In [56]:
moneyball['OBP'].describe()

count    37131.000000
mean         0.310811
std          0.062433
min          0.000000
25%          0.285256
50%          0.319853
75%          0.350000
max          0.609400
Name: OBP, dtype: float64

In [57]:
fielding[fielding['playerID'] == 'carltst01']

         playerID  yearID teamID POS
64332   carltst01    1965    SLN   P
65690   carltst01    1966    SLN   P
67057   carltst01    1967    SLN   P
68449   carltst01    1968    SLN   P
69864   carltst01    1969    SLN   P
71617   carltst01    1970    SLN   P
73354   carltst01    1971    SLN   P
75046   carltst01    1972    PHI   P
76725   carltst01    1973    PHI   P
78470   carltst01    1974    PHI   P
80262   carltst01    1975    PHI   P
82071   carltst01    1976    PHI   P
83946   carltst01    1977    PHI   P
85904   carltst01    1978    PHI   P
87771   carltst01    1979    PHI   P
89686   carltst01    1980    PHI   P
91608   carltst01    1981    PHI   P
93414   carltst01    1982    PHI   P
95373   carltst01    1983    PHI   P
97347   carltst01    1984    PHI   P
99317   carltst01    1985    PHI   P
101271  carltst01    1986    PHI   P
101272  carltst01    1986    SFN   P
101273  carltst01    1986    CHA   P
103296  carltst01    1987    CLE   P
103297  carltst01    1987    MIN   P
105425  carltst01    1988    MIN   P

In [58]:
batting[batting['playerID'] == 'carltst01']

        playerID  yearID teamID   G     AB     H   BB  HBP   SF
44328  carltst01    1965    SLN  15    2.0   0.0  0.0  0.0  0.0
45077  carltst01    1966    SLN   9   15.0   4.0  0.0  1.0  0.0
45855  carltst01    1967    SLN  30   72.0  11.0  3.0  0.0  0.0
46626  carltst01    1968    SLN  35   73.0  12.0  0.0  0.0  0.0
47376  carltst01    1969    SLN  32   80.0  17.0  3.0  0.0  0.0
48301  carltst01    1970    SLN  34   80.0  16.0  1.0  4.0  0.0
49220  carltst01    1971    SLN  37   96.0  17.0  4.0  0.0  0.0
50102  carltst01    1972    PHI  41  117.0  23.0  5.0  1.0  0.0
50996  carltst01    1973    PHI  40  100.0  16.0  2.0  0.0  1.0
51883  carltst01    1974    PHI  39  102.0  25.0  0.0  0.0  3.0
52795  carltst01    1975    PHI  37   90.0  14.0  5.0  0.0  0.0
53697  carltst01    1976    PHI  35   92.0  20.0  1.0  2.0  0.0
54602  carltst01    1977    PHI  36   97.0  26.0  2.0  1.0  3.0
55578  carltst01    1978    PHI  34   86.0  25.0  3.0  0.0  1.0
56535  carltst01    1979    PHI  36   94.0  21.0  3.0  1.0  1.0
57504  carltst01    1980    PHI  38  101.0  19.0  1.0  0.0  3.0
58451  carltst01    1981    PHI  24   67.0   9.0  2.0  0.0  0.0
59394  carltst01    1982    PHI  38  101.0  22.0  0.0  0.0  0.0
60395  carltst01    1983    PHI  37   97.0  19.0  2.0  0.0  0.0
61391  carltst01    1984    PHI  34   84.0  16.0  2.0  0.0  0.0
62377  carltst01    1985    PHI  16   28.0   5.0  1.0  0.0  1.0
63378  carltst01    1986    PHI  16   34.0   7.0  1.0  0.0  0.0
63379  carltst01    1986    SFN   6   11.0   2.0  0.0  0.0  0.0
63380  carltst01    1986    CHA  10    NaN   NaN  NaN  NaN  NaN
64394  carltst01    1987    CLE  23    NaN   NaN  NaN  NaN  NaN
64395  carltst01    1987    MIN   9    NaN   NaN  NaN  NaN  NaN
65455  carltst01    1988    MIN   4    NaN   NaN  NaN  NaN  NaN